<?php
function d($value)
{
  echo '<pre>';
  var_dump($value);
  echo '</pre>';
}

//跟索引数组的声明方式完成一样。不过不同的是，必须要指定字符串的下标和必须要使用键值对应符。
//声明一下关联数组
$rela = array('帅' => '成龙',
  '很帅' => '黄晓明',
  '灰常灰常帅' => '宁泽涛',
  '有男人味的大叔' => '吴秀波',
  );



//再来玩玩简洁声明
$drink =[
  '美' => '凤姐',
  '很美' => '芙蓉姐姐',
  'verymei' => '杨幂',
  '心中的女神' => '华妃',
  100 => '孙俪',
  '娘娘',
];

// 输出$drink

d($drink);

// 关联数组中的索引数组的元素后再声明了无下标的元素，
// 依然是最大值+1原则。(观察上图中的值为孙俪、娘娘的两个元素)。
/*
array(4) {
  ["帅"]=>
  string(6) "成龙"
  ["很帅"]=>
  string(9) "黄晓明"
  ["灰常灰常帅"]=>
  string(9) "宁泽涛"
  ["有男人味的大叔"]=>
  string(9) "吴秀波"
}
array(6) {
  ["美"]=>
  string(6) "凤姐"
  ["很美"]=>
  string(12) "芙蓉姐姐"
  ["verymei"]=>
  string(6) "杨幂"
  ["心中的女神"]=>
  string(6) "华妃"
  [100]=>
  string(6) "孙俪"
  [101]=>
  string(6) "娘娘"
}
*/

###关联数组的增、删、改
$drink['kx'] = '康熙';
d($drink);


$drink['midi'] = '迷笛';

d($drink);


//删除一个试试
unset($drink['verymei']);
d($drink);

//将芙蓉姐姐 改成：心里美才是真的美
$drink['很美'] = '心里美才是真的美';
d($drink);
 ?>
